<?php

use yii\db\Migration;

/**
 * Handles the creation of table `{{%group}}`.
 */
class m210527_102027_create_group_table extends Migration
{
    /**
     * {@inheritdoc}
     */
    public function safeUp()
    {
        $this->createTable('{{%group}}', [
            'id' => $this->primaryKey(),
            'name' => $this->string(100)->notNull()->comment('Наименование'),
        ]);

        $this->batchInsert('{{%group}}', ['name'], [
            ['Акушерство, гинекология'],
            ['Аллергия'],
            ['Анестезия, реанимация'],
            ['Антибиотики'],
            ['Болезни крови'],
            ['Боль, температура'],
            ['Геморрой'],
            ['Глаза'],
            ['Глисты, вши, чесотка'],
            ['Гомеопатия'],
            ['Детское здоровье'],
            ['Диабет'],
            ['Диагностические средства'],
            ['Дыхательная система'],
            ['Желудок, кишечник, печень'],
            ['Зубы и рот'],
            ['Иммунная система'],
            ['Кожа'],
            ['Мочеполовая система'],
            ['Нарушения обмена веществ'],
            ['Неврология, психиатрия'],
            ['Обеззараживающие средства'],
            ['Онкология'],
            ['Отравления'],
            ['Питательные смеси'],
            ['Противовирусные средства'],
            ['Противогрибковые средства'],
            ['Разное'],
            ['Сердечно-сосудистые'],
            ['Трихомоноз и малярия'],
            ['Ухо, горло, нос'],
            ['Эндокринология'],
        ]);
    }

    /**
     * {@inheritdoc}
     */
    public function safeDown()
    {
        $this->dropTable('{{%group}}');
    }
}
